src/InformationRegisters/ЖурналСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдКанала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Мессенджер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Мессенджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщенияUTF8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОтКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОператорСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аудио</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PDF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Триггер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдНаписавшегоВГруппу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжиданиеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СлужебноеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПересланноеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтактыМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтактыМессенджеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектИдентификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдПоследнегоДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерМессенджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчаствоватьВРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбработана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПропущенныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвеченныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвеченныйДиалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перезвонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/HTTPServices/JivoSite/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Функция, обработка POST запроса, который прилетает с сайта JivpSite.
Функция api_v1МетодPOST(Запрос)
		
	УстановитьПривилегированныйРежим(Истина);	
	
	БазовыйURL = Запрос.БазовыйURL;
	
	ТекстJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	ПараметрыJSON = ПрочитатьJSON(ЧтениеJSON);	
	
	ТаблицаВнешнихСистем 	= Справочники.ВнешниеСистемы.ПолучитьВнешниеСистемы(Перечисления.ТипыВнешнихСистем.JivoSite);
	IDЗапроса 				= Сред(Запрос.ПараметрыURL.Получить("*"), 2);
	IDВнешнейСистемы 		= ?(ТаблицаВнешнихСистем.Количество() > 0, ТаблицаВнешнихСистем[0].Ссылка.КлючПриложения, Неопределено);
	
	Если IDЗапроса <> IDВнешнейСистемы Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Ответ1с = Новый Структура;
	
	Если ПараметрыJSON.event_name = "chat_accepted" Тогда
		
		Ответ1с.Вставить("result", "ok");
		Ответ1с.Вставить("enable_assign", Ложь);
		
		custom_data = Новый Массив;
		custom_data.Добавить(Новый Структура("title", "Потенциальный клиент"));
		Ответ1с.Вставить("custom_data", custom_data);		
		
		Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруJivoSite(Строка(ПараметрыJSON.visitor.number));
		
		Если ЗначениеЗаполнено(Заявка) Тогда
			
			ОсновнойКлиент = Заявка.ОсновнойКлиент;
			
			Если ЗначениеЗаполнено(ОсновнойКлиент) Тогда
				
				МассивТелефон = ОсновнойКлиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
				МассивАдресЭП = ОсновнойКлиент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
				
				contact_info = Новый Структура();
				contact_info.Вставить("name",  ОсновнойКлиент.НаименованиеПолное);
				contact_info.Вставить("phone", ?(ЗначениеЗаполнено(МассивТелефон), МассивТелефон[0].НомерТелефона, Неопределено));
				contact_info.Вставить("email", ?(ЗначениеЗаполнено(МассивАдресЭП), МассивАдресЭП[0].АдресЭП, Неопределено));
				
				Ответ1с.Вставить("contact_info", contact_info);
				
			КонецЕсли;
			
		Иначе
			
			Заявка = СоздатьЗаявку(ПараметрыJSON);			
			
		КонецЕсли;
		
		НавигационнаяСсылкаЗаявки = ПолучитьНавигационнуюСсылку(Заявка);
		ВнешнийАдресс = Константы.ВнешняяПубликацияАдрес.Получить();
		
		Если ЗначениеЗаполнено(ВнешнийАдресс)
			И ЗначениеЗаполнено(НавигационнаяСсылкаЗаявки) Тогда
			
			Ответ1с.Вставить("crm_link", ВнешнийАдресс + "#" + НавигационнаяСсылкаЗаявки);	
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыJSON.event_name = "offline_message" Тогда
				
		Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруJivoSite(Строка(ПараметрыJSON.visitor.number));
		
		Если НЕ ЗначениеЗаполнено(Заявка) Тогда
			
			Заявка = СоздатьЗаявку(ПараметрыJSON);			
			
		КонецЕсли;
		
		Ошибка = "";
		МассивСообщений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыJSON.message, Символы.ПС, Истина);
		
		Для Индекс = 0 По МассивСообщений.ВГраница() Цикл
					
			НоваяЗапись = РегистрыСведений.ЖурналСообщений.СоздатьМенеджерЗаписи();
			НоваяЗапись.ДатаСообщения 	= ТекущаяДатаСеанса()- 60 + Индекс; // Внутрення защита jivosite метода offline_message 1-2 минуты, защита от спама. Сообщения отправляются на почту.
			НоваяЗапись.Период 			= НоваяЗапись.ДатаСообщения;
			НоваяЗапись.ВнешняяСистема	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite);
			НоваяЗапись.ИдОператора 	= 0;
			НоваяЗапись.ИдКлиента 		= Строка(Формат(ПараметрыJSON.visitor.number, "ЧГ="));
			НоваяЗапись.ТекстСообщения 	= МассивСообщений[Индекс];
			НоваяЗапись.Прочитано		= Истина;
			
			Попытка		   
				НоваяЗапись.Записать(); 			   
			Исключение			   
				Ошибка = ОписаниеОшибки();			   
			КонецПопытки;
		
		КонецЦикла;
				
		Ответ1с.Вставить("result", ?(ЗначениеЗаполнено(Ошибка), "FAILURE", "OK"));	   

	ИначеЕсли ПараметрыJSON.event_name = "chat_updated" Тогда 	
		
		Заявка = Справочники.Заявки.ПолучитьЗаявкуПоНомеруJivoSite(Строка(ПараметрыJSON.visitor.number));
		Клиент = ?(ЗначениеЗаполнено(Заявка), Заявка.ОсновнойКлиент, Неопределено);
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			КлиентОбъект = Клиент.ПолучитьОбъект();
			
			// Запись ФИО клиента.
			Если КлиентОбъект.НаименованиеПолное <> ПараметрыJSON.visitor.name Тогда
				
				СтруктруаФИО = ОбщегоНазначения.ВернутьФИОКлиента(ПараметрыJSON.visitor.name);	
				
				КлиентОбъект.Фамилия  = ?(СтруктруаФИО.Свойство("Фамилия"), СтруктруаФИО.Фамилия, "");
				КлиентОбъект.Имя 	  = ?(СтруктруаФИО.Свойство("Имя"), СтруктруаФИО.Имя, "");
				КлиентОбъект.Отчество = ?(СтруктруаФИО.Свойство("Отчество"), СтруктруаФИО.Отчество, "");

				КлиентОбъект.ДополнительныеСвойства.Вставить("МодифицироватьНаименованиеКонтрагента");
	
			КонецЕсли;
			
			// Запись новых телефонов.
			МассивТелефонов = КлиентОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон));
			НомерТелефонаССайта = ?(Строка(Лев(ПараметрыJSON.visitor.phone, 1)) = "+",  Сред(ПараметрыJSON.visitor.phone, 2), ПараметрыJSON.visitor.phone);
			
			Для каждого ЭлементМассива Из МассивТелефонов Цикл
			
				ТакойТелефонЕсть = ?(ЭлементМассива.НомерТелефона = НомерТелефонаССайта, Истина, Ложь);
										
			КонецЦикла;
			
			Если ТакойТелефонЕсть = Ложь Тогда
				
				ВидКИ         = Справочники.ВидыКонтактнойИнформации.ТелефонКлиента; 
				ТипКИ         = Перечисления.ТипыКонтактнойИнформации.Телефон;
				ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOВXML(
								УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(ПараметрыJSON.visitor.phone, ВидКИ));	
		
				УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформациюСтоматология(КлиентОбъект, ЗначенияПолей, ВидКИ, ТипКИ);
				
			КонецЕсли;
			
			// Запись новых адресов электронных почт.
			Если ПараметрыJSON.visitor.Свойство("email") Тогда
				
				МассивПочт = КлиентОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
				
				ТакаяПочтаЕсть = Ложь;
				
				Для каждого ЭлементМассива Из МассивПочт Цикл
					
					ТакаяПочтаЕсть = ?(ЭлементМассива.АдресЭП = ПараметрыJSON.visitor.email, Истина, Ложь);
					
				КонецЦикла;
				
				Если ТакаяПочтаЕсть = Ложь Тогда
					
					ВидКИ       = Справочники.ВидыКонтактнойИнформации.EmailКлиента; 
					ТипКИ       = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;					
					Значение 	= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияПоПредставлению(ПараметрыJSON.visitor.email, ВидКИ));

					УправлениеКонтактнойИнформациейСтоматология.ЗаписатьКонтактнуюИнформациюСтоматология(КлиентОбъект, Значение, ВидКИ, ТипКИ);
					
				КонецЕсли;
				
			КонецЕсли;
				
		   КлиентОбъект.Записать();
		
	   КонецЕсли;
	   
   ИначеЕсли ПараметрыJSON.event_name = "chat_finished" Тогда 		
	   
	   Ошибка = "";
	   МассивСообщений = ПараметрыJSON.chat.messages;
	   
	   Для каждого Сообщение Из МассивСообщений Цикл
		   
		   НоваяЗапись = РегистрыСведений.ЖурналСообщений.СоздатьМенеджерЗаписи();
		   НоваяЗапись.ДатаСообщения 	= Дата(1970,1,1,3,0,0) + Сообщение.timestamp;
		   НоваяЗапись.Период 			= НоваяЗапись.ДатаСообщения;
		   НоваяЗапись.ВнешняяСистема	= Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite);
		   НоваяЗапись.ИдОператора 		= ?(Сообщение.Свойство("agent_id"), Строка(Формат(Сообщение.agent_id, "ЧГ=")), "0");
		   НоваяЗапись.ИдКлиента 		= Строка(Формат(ПараметрыJSON.visitor.number, "ЧГ="));
		   НоваяЗапись.ТекстСообщения 	= Сообщение.message;
		   НоваяЗапись.Прочитано		= Истина;
		   
		   Попытка		   
			   НоваяЗапись.Записать(); 			   
		   Исключение			   
			   Ошибка = ОписаниеОшибки();			   
		   КонецПопытки;	  
		   
	   КонецЦикла;
	   
	   Если НЕ ЗначениеЗаполнено(Ошибка) Тогда	   
		   Ответ1с.Вставить("result", "ok");	   
	   КонецЕсли;
	   
	КонецЕсли;
	
	Возврат ПолучитьHTTPОтвет(Ответ1с);	
	
КонецФункции

// Функция, возвращает HTTPОтвет. 
//
Функция ПолучитьHTTPОтвет(Ответ1с, КодОтвета = Неопределено)
	
	КодОтвета = ?(КодОтвета = Неопределено, 200, КодОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто);		
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);	
	ЗаписатьJSON(ЗаписьJSON, Ответ1С);
	
	КодОтвета = 200;
	Если ТипЗнч(Ответ1С) = Тип("Структура") и Ответ1С.Свойство("Error") и Ответ1С.Error > 0 Тогда
		КодОтвета = 400;
	КонецЕсли;          	
	
	мОтвет = ЗаписьJSON.Закрыть(); 		
	HTTPОтвет = Новый HTTPСервисОтвет(КодОтвета);
	HTTPОтвет.УстановитьТелоИзСтроки(мОтвет);
	HTTPОтвет.Заголовки["Content-Type"] = "application/json";	
	
	Возврат HTTPОтвет; 
	
КонецФункции

// Функция, возвращает новую созданную заявку.
Функция СоздатьЗаявку(Структура)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.JivoSite);
	НоваяЗаявка = Справочники.Заявки.СоздатьЭлемент();
	
	СтруктураЗаполнения = Новый Структура();
	СтруктруаФИО = ОбщегоНазначения.ВернутьФИОКлиента(Структура.visitor.name);

	СтруктураЗаполнения.Вставить("Фамилия"			, ?(СтруктруаФИО.Свойство("Фамилия")	, СтруктруаФИО.Фамилия	, Неопределено));
	СтруктураЗаполнения.Вставить("Имя"				, ?(СтруктруаФИО.Свойство("Имя")		, СтруктруаФИО.Имя		, Неопределено));
	СтруктураЗаполнения.Вставить("Отчество"			, ?(СтруктруаФИО.Свойство("Отчество")	, СтруктруаФИО.Отчество	, Неопределено));

	СтруктураЗаполнения.Вставить("НомерТелефона"	, ?(Структура.visitor.Свойство("phone")	, Структура.visitor.phone, Неопределено));
	СтруктураЗаполнения.Вставить("АдресЭП"			, ?(Структура.visitor.Свойство("email")	, Структура.visitor.email, Неопределено));

	СтруктураЗаполнения.Вставить("РекламнаяСсылка"	, ?(Структура.Свойство("page") И Структура.page.Свойство("url"), Структура.page.url, Неопределено)); 
	СтруктураЗаполнения.Вставить("ВнешняяСистема"	, ВнешняяСистема); 
	СтруктураЗаполнения.Вставить("КаналПривлеченияЗначение", Справочники.КаналыПривлечения.ЧатСКлиентом);
	
	Если ЗначениеЗаполнено(ВнешняяСистема) И ЗначениеЗаполнено(ВнешняяСистема.СтруктурнаяЕдиница) Тогда
		 СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница", ВнешняяСистема.СтруктурнаяЕдиница); 
	КонецЕсли;
	
	МассивКлиентов = Новый Массив;
	КонтрагентыПоНомеруТелефона = Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(, Перечисления.ТипыКонтактнойИнформации.Телефон, СтруктураЗаполнения.НомерТелефона);
	КонтрагентыПоНомеруАдресуЭП = Справочники.Контрагенты.ПроверитьНаДублированиеКлиентаКИ(, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, СтруктураЗаполнения.АдресЭП);
	
	Если ЗначениеЗаполнено(КонтрагентыПоНомеруТелефона) Тогда
		ОбщегоНазначения.ДобавитьВМассив(МассивКлиентов, КонтрагентыПоНомеруТелефона, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтрагентыПоНомеруАдресуЭП) Тогда
		ОбщегоНазначения.ДобавитьВМассив(МассивКлиентов, КонтрагентыПоНомеруАдресуЭП, Истина);
	КонецЕсли;
	
	Если МассивКлиентов.Количество()>0 Тогда

		СтруктураЗаполнения.Вставить("ОсновнойКлиент", МассивКлиентов[0].Ссылка);
		СтруктураЗаполнения.Вставить("Статус", Перечисления.СтатусыЗаявок.Принята);
		
	КонецЕсли;

	НоваяЗаявка.Заполнить(СтруктураЗаполнения);
	
	НоваяЗаявка.ДополнительныеСвойства.Вставить("ОнлайнЗаявка", Истина);
	
	Попытка	
		НоваяЗаявка.Записать();	
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	НоваяЗапись = РегистрыСведений.КонтактыМессенджеров.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВнешняяСистема 		= ВнешняяСистема;
	НоваяЗапись.Идентификатор 		= Строка(Формат(Структура.visitor.number, "ЧГ="));
	НоваяЗапись.ОбъектИдентификации = НоваяЗаявка.Ссылка;
	НоваяЗапись.Записать();
	
	Возврат НоваяЗаявка;
	
КонецФункции

#КонецОбласти
